Revit 2024 API
BuiltInFailures.SiteImportFailures.NoViewSpecificSiteImports Property
 Can't make Toposurface from View Specific Imports.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoViewSpecificSiteImports { get; }
Visual Basic
Public Shared ReadOnly Property NoViewSpecificSiteImports As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoViewSpecificSiteImports {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace